09:22:32 From Yevhen Kariev to Everyone:
	Morgen!
09:42:56 From Starta Institute 36 to Everyone:
	Напишите программу которая может поменять местами значения, хранящиеся в двух переменных с помощью третьей переменной
09:50:08 From Starta Institute 36 to Everyone:
	Напишите программу на Java, которая может  поменять местами значения, хранящиеся в двух переменных, без использования третьей переменной.
09:51:16 From Yevhen Kariev to Everyone:
	public class Main {	    public static void main(String[] args) {	        int a = 5, b = 7, c;		//        c = a;	//        a = b;	//        b = c;	//	//	//        System.out.println(a + " " + b);		        a = a + b;	        b = a - b;	        a = a - b;		        System.out.println(a + " " + b);		    }	}
10:11:15 From Starta Institute 36 to Everyone:
	int num = 5;
	//        unary -
	//        int numTwo = -num;
	//        System.out.println("num = " + num);
	//        System.out.println("numTwo = " + numTwo);
	//        System.out.println("-num = " + (-num));
	//        increment
	//        num++;
	//        num = num + 1;
	//        num += 1;
	//        postfix
	//        num++;
	//        System.out.println(num++);
	//        int tmp = num;
	//        System.out.println(tmp);
	//        prefix
	//        System.out.println(++num);
	//        decrement
	//        num--;
	//        num = num - 1;
	//        num -= 1;
	//        num--;
	//        postfix
	//        System.out.println(num--);
	//        System.out.println(num);
	//        prefix
	        System.out.println(--num);
10:21:55 From Starta Institute 36 to Everyone:
	int i = 5;
	int j = i++ + ++i;
	System.out.println(j);
10:24:54 From Starta Institute 36 to Everyone:
	int i = 5;
	System.out.println(i);
	int j = i++ + ++i;
	System.out.println(j);
	System.out.println(i);
10:26:12 From Starta Institute 36 to Everyone:
	Создайте класс Unary
	Создайте переменную с положительным знаком
	Измените знак на отрицательный используя унарный минус
	Результат распечатайте в консоле
10:37:09 From Starta Institute 36 to Everyone:
	Создайте класс UnaryTest
	Создайте переменную с положительным знаком
	Примените к переменной пост-инкремент и пост-декремент
	Примените к переменной пре-инкремент и пре-декремент
	Используя режим дебаггера проследите изменения
11:16:33 From Starta Institute 36 to Everyone:
	Создайте три переменные
	Сравните поочередно каждые из созданных переменных используя реляционные операторы
	Результат распечатайте в консоль
11:30:45 From Starta Institute 36 to Everyone:
	Создайте три переменные
	Сравните поочередно попарно каждые из созданных переменных используя реляционные и логические операторы
	Результат распечатайте в консоль
11:43:26 From Starta Institute 36 to Everyone:
	int i = 5; // 0101
	        int j = 2; // 0010
	//        i + j
	//        0101 // 5
	//        +
	//        0010 // 2
	//        --------------
	//        0111 // 7
11:52:21 From OleksiiBielykh to Everyone:
	У Карины вылетел интернет
11:53:56 From Starta Institute 36 to Everyone:
	https://practicum.yandex.ru/blog/operatory-java/
11:57:20 From Starta Institute 36 to Everyone:
	Создайте переменные int a, b, c, d;
	Используя блок if (выражение) {}, составьте логические выражения
	истина , если “а” меньше “b” И “b” равно “c”;
	истина , если “а” больше “b” ИЛИ “c” равно “d”;
	истина , если “а” НЕ равно “b”;
12:09:34 From Vladimir Gubarev to Everyone:
	int a = 5;
	int b = 6;
	int c = 7;
	int d = 10;
	if((a < b && b == c) || (a >b || c == d) || (a !=b)) {
	    System.out.println(true);
	} else{
	    System.out.println(false);
	}
12:34:11 From Artur Gabdrakipov to Everyone:
	ответ b
